01 indexCounter PIC 9(4) VALUE 0.
01 trash PIC X(10).
01 EOF PIC X VALUE 'N'.
01 COL-1 OCCURS 1000 TIMES PIC X(5).
01 COL-2 OCCURS 1000 TIMES PIC X(5).
77 WS-ROW PIC 9(5) VALUE 0.
77 WS-COLUMN PIC 9(5) VALUE 0.