IDENTIFICATION DIVISION.
PROGRAM-ID. Day1.

COPY 'input_file.cpy'.

WORKING-STORAGE SECTION.
COPY 'input_working_storage.cpy'.
77 CALCTMP BINARY-LONG.
77 CALCTMP2 BINARY-LONG.
77 TOTAL BINARY-LONG VALUE 0.

PROCEDURE DIVISION.
    MAIN-PROGRAM.
        PERFORM INITIALIZE-GRID.

        SORT COL-1 ON ASCENDING KEY COL-1
        SORT COL-2 ON ASCENDING KEY COL-2

        PERFORM CALCULATE-DISTANCES.

        STOP RUN.

    COPY 'input_initialize.cpy'.

    CALCULATE-DISTANCES.
        PERFORM VARYING WS-ROW FROM 1 BY 1 UNTIL WS-ROW > 1000
            MOVE COL-1(WS-ROW) TO CALCTMP
            MOVE COL-2(WS-ROW) TO CALCTMP2
            SUBTRACT CALCTMP2 FROM CALCTMP
            MOVE FUNCTION ABS(CALCTMP) TO CALCTMP
            ADD CALCTMP TO TOTAL
        END-PERFORM
        DISPLAY "Total " TOTAL.
