IDENTIFICATION DIVISION.
PROGRAM-ID. Day1.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 COL-1 OCCURS 6 TIMES PIC X(1).
01 COL-2 OCCURS 6 TIMES PIC X(1).
*> 01 GRID OCCURS 6 TIMES.
*>      05 COL-1 PIC X(1).
*>      05 COL-2 PIC X(1).
77 WS-ROW PIC 9 VALUE 0.
77 WS-COLUMN PIC 9 VALUE 0.
01 num BINARY-LONG.
01 i BINARY-LONG.
01 tot BINARY-LONG VALUE 0.
77 TEMP-COL-1 PIC 9.
77 TEMP-COL-2 PIC 9.
77 WS-I PIC 9 VALUE 0.
77 WS-J PIC 9 VALUE 0.
77 CALCTMP BINARY-LONG.
77 CALCTMP2 BINARY-LONG.
77 TOTAL BINARY-LONG VALUE 0.

PROCEDURE DIVISION.
    MAIN-PROGRAM.
        DISPLAY "Hello World!".
        ACCEPT num.

        PERFORM VARYING i FROM 1 BY 1 UNTIL I > num
            ADD i TO tot
            DISPLAY "Adding " i " to the total resulted in " tot
        END-PERFORM

        DISPLAY "The sum is " tot.
        PERFORM INITIALIZE-GRID.
        PERFORM DISPLAY-GRID.

        SORT COL-1 ON ASCENDING KEY COL-1
        SORT COL-2 ON ASCENDING KEY COL-2

        PERFORM DISPLAY-GRID.

        PERFORM CALCULATE_DISTANCES.

        STOP RUN.

    INITIALIZE-GRID.
        MOVE 3 TO COL-1(1) MOVE 4 TO COL-2(1)
        MOVE 4 TO COL-1(2) MOVE 3 TO COL-2(2)
        MOVE 2 TO COL-1(3) MOVE 5 TO COL-2(3)
        MOVE 1 TO COL-1(4) MOVE 3 TO COL-2(4)
        MOVE 3 TO COL-1(5) MOVE 9 TO COL-2(5)
        MOVE 3 TO COL-1(6) MOVE 3 TO COL-2(6).

    CALCULATE_DISTANCES.
        PERFORM VARYING WS-ROW FROM 1 BY 1 UNTIL WS-ROW > 6
            MOVE COL-1(WS-ROW) TO CALCTMP
            MOVE COL-2(WS-ROW) TO CALCTMP2
            DISPLAY "Subtracting " CALCTMP2 " from " CALCTMP
            SUBTRACT CALCTMP2 FROM CALCTMP
            DISPLAY "Adding " CALCTMP " to " TOTAL
            ADD CALCTMP TO TOTAL
        END-PERFORM
        DISPLAY "Total " TOTAL.

    DISPLAY-GRID.
        PERFORM VARYING WS-ROW FROM 1 BY 1 UNTIL WS-ROW > 6
            DISPLAY "Row " WS-ROW ": " COL-1(WS-ROW) ", " COL-2(WS-ROW)
            DISPLAY ""  *> Move to the next line
        END-PERFORM.
